In [1]:
import pandas as pd
import numpy as np

In [3]:
#dataset of Third year students from different branch (CS,IT,EnTC) with different CGPA
df = pd.read_csv('/home/pict/31267_Sandhya_DS&BDAL/loan_sanction_test.csv')
df

,Loan_ID,Gender,Education,ApplicantIncome,CoapplicantIncome,LoanAmount,Property_Area
0,LP001015,Male,Graduate,5720,0,110.0,Urban
1,LP001022,Male,Graduate,3076,1500,126.0,Urban
2,LP001031,Male,Graduate,5000,1800,208.0,Urban
3,LP001035,Male,Graduate,2340,2546,100.0,Urban
4,LP001051,Male,Not Graduate,3276,0,78.0,Urban
...,...,...,...,...,...,...,...
362,LP002971,Male,Not Graduate,4009,1777,113.0,Urban
363,LP002975,Male,Graduate,4158,709,115.0,Urban
364,LP002980,Male,Graduate,3250,1993,126.0,Semiurban
365,LP002986,Male,Graduate,5000,2393,158.0,Rural
366,LP002989,Male,Graduate,9200,0,98.0,Rural

In [4]:
df['CoapplicantIncome'].min()

0

In [5]:
df['CoapplicantIncome'].max()

24000

In [6]:
# these are the 'CoapplicantIncome' years in the data
np.array(sorted(df.CoapplicantIncome.unique()))

array([    0,   187,   250,   292,   296,   333,   437,   440,   528,
         542,   618,   700,   709,   717,   738,   750,   818,   820,
         828,   833,   879,   910,  1000,  1025,  1083,  1103,  1110,
        1120,  1152,  1184,  1213,  1250,  1270,  1287,  1300,  1350,
        1380,  1400,  1411,  1442,  1456,  1475,  1497,  1500,  1516,
        1517,  1541,  1542,  1550,  1558,  1560,  1585,  1594,  1600,
        1620,  1646,  1658,  1683,  1704,  1707,  1721,  1760,  1762,
        1768,  1775,  1777,  1788,  1800,  1820,  1902,  1917,  1936,
        1951,  1963,  1966,  1993,  1998,  2000,  2015,  2017,  2024,
        2057,  2088,  2094,  2108,  2125,  2130,  2139,  2166,  2167,
        2168,  2183,  2233,  2286,  2291,  2333,  2360,  2367,  2370,
        2374,  2382,  2393,  2400,  2416,  2417,  2444,  2458,  2474,
        2500,  2529,  2546,  2565,  2600,  2619,  2632,  2666,  2667,
        2690,  2708,  2717,  2730,  2738,  2755,  2774,  2792,  2833,
        2845,  2900,  2912,  2916,  2925,  2935,  2945,  2988,  2999,
        3077,  3145,  3148,  3167,  3250,  3308,  3333,  3338,  3355,
        3396,  3422,  3435,  3470,  3510,  3539,  3575,  3583,  3664,
        3719,  3725,  3750,  3769,  3803,  3809,  3900,  3916,  3917,
        3967,  4000,  4027,  4029,  4053,  4123,  4200,  4246,  4255,
        4256,  4275,  4288,  4309,  4347,  4380,  4583,  4614,  4700,
        4754,  4831,  5000,  5105,  5211,  5272,  6414,  7916,  8000,
       11666, 13983, 14507, 15000, 24000])

In [7]:
len(np.array(sorted(df.CoapplicantIncome.unique())))

194

In [8]:
df.drop_duplicates(subset=['CoapplicantIncome'])

,Loan_ID,Gender,Education,ApplicantIncome,CoapplicantIncome,LoanAmount,Property_Area
0,LP001015,Male,Graduate,5720,0,110.0,Urban
1,LP001022,Male,Graduate,3076,1500,126.0,Urban
2,LP001031,Male,Graduate,5000,1800,208.0,Urban
3,LP001035,Male,Graduate,2340,2546,100.0,Urban
5,LP001054,Male,Not Graduate,2165,3422,152.0,Urban
...,...,...,...,...,...,...,...
361,LP002969,Male,Graduate,2269,2167,99.0,Semiurban
362,LP002971,Male,Not Graduate,4009,1777,113.0,Urban
363,LP002975,Male,Graduate,4158,709,115.0,Urban
364,LP002980,Male,Graduate,3250,1993,126.0,Semiurban
365,LP002986,Male,Graduate,5000,2393,158.0,Rural

In [9]:
df.CoapplicantIncome.value_counts()

0       156
700       3
2000      3
1250      2
1760      2
       ...
1270      1
2925      1
2999      1
528       1
2393      1
Name: CoapplicantIncome, Length: 194, dtype: int64

In [10]:
bins= [0,1500,3000,4500,24000]
labels = ['0-1499','1500-2999','3000-4499','4500-24000']
df['Income_Category'] = pd.cut(df['CoapplicantIncome'], bins=bins,labels=labels, right=False)

In [11]:
df['Income_Category'].value_counts()

0-1499        205
1500-2999     102
3000-4499      43
4500-24000     16
Name: Income_Category, dtype: int64

In [12]:
bins= [0,1500,3000,4500,24000]
labels = ['Poor','lower middle class','middleclass','rich']
df['Name_Income_Category'] = pd.cut(df['CoapplicantIncome'], bins=bins,labels=labels, right=False)

In [13]:
df

,Loan_ID,Gender,Education,ApplicantIncome,CoapplicantIncome,LoanAmount,Property_Area,Income_Category,Name_Income_Category
0,LP001015,Male,Graduate,5720,0,110.0,Urban,0-1499,Poor
1,LP001022,Male,Graduate,3076,1500,126.0,Urban,1500-2999,lower middle class
2,LP001031,Male,Graduate,5000,1800,208.0,Urban,1500-2999,lower middle class
3,LP001035,Male,Graduate,2340,2546,100.0,Urban,1500-2999,lower middle class
4,LP001051,Male,Not Graduate,3276,0,78.0,Urban,0-1499,Poor
...,...,...,...,...,...,...,...,...,...
362,LP002971,Male,Not Graduate,4009,1777,113.0,Urban,1500-2999,lower middle class
363,LP002975,Male,Graduate,4158,709,115.0,Urban,0-1499,Poor
364,LP002980,Male,Graduate,3250,1993,126.0,Semiurban,1500-2999,lower middle class
365,LP002986,Male,Graduate,5000,2393,158.0,Rural,1500-2999,lower middle class
366,LP002989,Male,Graduate,9200,0,98.0,Rural,0-1499,Poor

In [14]:
df.Name_Income_Category.value_counts()

Poor                  205
lower middle class    102
middleclass            43
rich                   16
Name: Name_Income_Category, dtype: int64

In [15]:
gk = df.groupby('Name_Income_Category')
gk.first()

,Loan_ID,Gender,Education,ApplicantIncome,CoapplicantIncome,LoanAmount,Property_Area,Income_Category
Name_Income_Category,,,,,,,,
Poor,LP001015,Male,Graduate,5720,0,110.0,Urban,0-1499
lower middle class,LP001022,Male,Graduate,3076,1500,126.0,Urban,1500-2999
middleclass,LP001054,Male,Not Graduate,2165,3422,152.0,Urban,3000-4499
rich,LP001108,Male,Graduate,9226,7916,300.0,Urban,4500-24000

In [16]:
# 'Poor' ka mean()
poor_mean = gk['ApplicantIncome'].get_group('Poor').mean()
poor_max = gk['ApplicantIncome'].get_group('Poor').max()
poor_median = gk['ApplicantIncome'].get_group('Poor').median()
poor_std = gk['ApplicantIncome'].get_group('Poor').std()
poor_min = gk['ApplicantIncome'].get_group('Poor').min()

In [17]:
poor_mean

5805.009756097561

In [18]:
poor_max

72529

In [19]:
poor_median

4456.0

In [20]:
poor_std

6107.438703704868

In [21]:
poor_min

1900

In [22]:
# 'lower middle class' ka mean()
lower_middle_class_mean = gk['ApplicantIncome'].get_group('lower middle class').mean()
lower_middle_class_max = gk['ApplicantIncome'].get_group('lower middle class').max()
lower_middle_class_median = gk['ApplicantIncome'].get_group('lower middle class').median()
lower_middle_class_std = gk['ApplicantIncome'].get_group('lower middle class').std()
lower_middle_class_min = gk['ApplicantIncome'].get_group('lower middle class').min()

In [23]:
lower_middle_class_mean

3087.8039215686276

In [24]:
lower_middle_class_max

10000

In [25]:
lower_middle_class_median

2928.0

In [26]:
lower_middle_class_std

1394.9534648486951

In [27]:
lower_middle_class_min

0

In [28]:
# 'middleclass' ka mean()
middleclass_mean = gk['ApplicantIncome'].get_group('middleclass').mean()
middleclass_max = gk['ApplicantIncome'].get_group('middleclass').max()
middleclass_median = gk['ApplicantIncome'].get_group('middleclass').median()
middleclass_std = gk['ApplicantIncome'].get_group('middleclass').std()
middleclass_min = gk['ApplicantIncome'].get_group('middleclass').min()

In [29]:
middleclass_mean

3920.767441860465

In [30]:
middleclass_max

8550

In [31]:
middleclass_median

3500.0

In [32]:
middleclass_std

1806.843391073811

In [33]:
middleclass_min

724

In [34]:
# 'Poor' ka mean()
rich_mean = gk['ApplicantIncome'].get_group('rich').mean()
rich_max = gk['ApplicantIncome'].get_group('rich').max()
rich_median = gk['ApplicantIncome'].get_group('rich').median()
rich_std = gk['ApplicantIncome'].get_group('rich').std()
rich_min = gk['ApplicantIncome'].get_group('rich').min()

In [35]:
rich_mean

5629.9375

In [36]:
rich_max

16000

In [37]:
rich_median

3937.5

In [38]:
rich_std

4543.398499930055

In [39]:
rich_min

1850